#+Title: CFEngine Zero to Hero Primer
#+Author: Nick Anderson
#+Email: nick@cmdln.org
#+PROPERTY: header-args:cfengine3+ :eval never-export
#+PROPERTY: header-args:sh+ :eval never-export
#+PROPERTY: header-args:shell+ :eval never-export
#+REVEAL_ROOT: file:///home/nickanderson/src/reveal.js/
#+OPTIONS: reveal_center:t reveal_progress:t reveal_history:nil reveal_control:t
#+OPTIONS: reveal_rolling_links:t reveal_keyboard:t reveal_overview:t num:nil
#+OPTIONS: reveal_width:1200 reveal_height:800
#+OPTIOnS: reveal_single_file:t
# The TOC is a bit much for a slide show IMHO
#+OPTIONS: toc:nil tags:nil timestamp:nil
#+REVEAL_MARGIN: 0.1
#+REVEAL_MIN_SCALE: 0.5
#+REVEAL_MAX_SCALE: 2.5
# Available Transitions: default|cube|page|concave|zoom|linear|fade|none.
#+REVEAL_TRANS: fade
# Themes: Black (default) - White - League - Sky - Beige - Simple - Serif - Blood - Night - Moon - Solarized 
#+REVEAL_THEME: white 
# ?? Guess this flattens up to x levels deep
#+REVEAL_HLEVEL: 1
#+REVEAL_HEAD_PREAMBLE: <meta name=description" content=CFEngine Zero to Hero Primer.">
#+REVEAL_POSTAMBLE: <p> Created by Nick Anderson. </p>
#+REVEAL_PLUGINS: (markdown notes)
#+REVEAL_EXTRA_CSS: ./local.css
# Do not eval cfengine src blocks automatically on export
# THIS WORKED #+property: header-args :eval never-export


#+BEGIN_COMMENT
# Derived from [[http://github.com/bahamat/cf-primer][CF-Primer: Zero to Hero]]
# Brian Bennett <bahamat@digitalelf.net>, @bahamat
# Aleksey Tsalolikhin <aleksey@verticalsysadmin.com>

Copyright 2013 Brian Bennett, Nick Anderson

Licensed under the Apache License, Version 2.0 (the "License");
you may not use this file except in compliance with the License.
You may obtain a copy of the License at

    http://www.apache.org/licenses/LICENSE-2.0

Unless required by applicable law or agreed to in writing, software
distributed under the License is distributed on an "AS IS" BASIS,
WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
** Example Promise
:PROPERTIES:
:ID:       c87caf72-3377-4a84-9113-1b71a86ad340
:END:

#+BEGIN_SRC cfengine3 :exports both
  bundle agent main {
    files:
      linux::
        "/tmp/example" -> { "Instructor", "Students" }
          create => "true",
          touch => "true",
          action => warn_only;
  }
#+END_SRC

#+RESULTS:
:  warning: Need to touch (update time stamps) for '/tmp/multiple-attributes', but only a warning was promised!

#+BEGIN_NOTES
  - This is a promise of *type* =files=.
  - This promise has a *class context* of =linux= (it will only apply if running a
    Linux kernel).
  - The *promiser* is the POSIX path =/tmp/example=.
  - This promise has three *attribute*, specifying that the file should be
    created if it does not exist, it's timestamp should be updated, and only
    warn about what the agent would do.
  - The *promisee* is both of us
  - To create a directory instead, use a =files:= promise and append a =.= to the
    directory name (e.g., =/tmp/hello/.=)
#+END_NOTES

*** What is m?

*PRO TIP:* The [[https://github.com/cfengine/core/tree/master/contrib/cf-locate][=cf-locate=]] script in [[https://github.com/cfengine/core/tree/master/contrib/][core/contrib]] can help you find and view
body and bundle definitions within your policy set.

#+BEGIN_SRC shell :results output :exports both
  cf-locate -f "perms m\(.*"
#+END_SRC

#+RESULTS:
#+begin_example
-> body or bundle matching 'perms m\(.*' found in /home/nickanderson/.cfagent/inputs/lib/files.cf:1582
body perms m(mode)
# @brief Set the file mode
# @param mode The new mode
{
      mode   => "$(mode)";
}
#+end_example

** Set File Permissions
:PROPERTIES:
:ID:       759fe7c4-fd50-4e0b-b9bb-0460d25c013f
:END:

#+caption: =set_file_permissions.cf=
#+BEGIN_SRC cfengine3 :tangle examples/set_file_permissions.cf
  bundle agent main {
    files:
      "/etc/shadow"     perms => perms_for_shadow_files;
      "/etc/gshadow"    perms => perms_for_shadow_files;
    reports: "Please run this policy as root" if => not( strcmp( "$(sys.user_data[gid]", "0" ) )); 
  }

  body perms perms_for_shadow_files {
    owners => { "root" };
    groups => { "root" };
    mode   => "0640";
  }
#+END_SRC

#+RESULTS:
#+begin_example
/home/nickanderson/src/presentations/CFEngine-zero-to-hero/cfengine3-22885Fvr:6:95: error: syntax error
  reports: "Please run this policy as root" if => not( strcmp( "$(sys.user_data[gid]", "0" ) )); 
                                                                                              ^
/home/nickanderson/src/presentations/CFEngine-zero-to-hero/cfengine3-22885Fvr:6:95: error: Check previous line, Expected ';', got ')'
  reports: "Please run this policy as root" if => not( strcmp( "$(sys.user_data[gid]", "0" ) )); 
                                                                                              ^
   error: There are syntax errors in policy files
   error: Policy failed validation with command '"/home/nickanderson/.cfagent/bin/cf-promises" -c "/home/nickanderson/src/presentations/CFEngine-zero-to-hero/cfengine3-22885Fvr"'
   error: CFEngine was not able to get confirmation of promises from cf-promises, so going to failsafe
   error: CFEngine failsafe.cf: /home/nickanderson/.cfagent/inputs /home/nickanderson/.cfagent/inputs/failsafe.cf
   error: No suitable server found
   error: No suitable server found
R: Built-in failsafe policy triggered
  notice: Q: ".../cf-agent" -f /":    error: Link '/usr/local/sbin/cf-key' points to '/var/cfengine/bin/cf-key' not '/home/nickanderson/.cfagent/bin/cf-key', error removing link
Q: ".../cf-agent" -f /":    error: Link '/usr/local/sbin/cf-agent' points to '/var/cfengine/bin/cf-agent' not '/home/nickanderson/.cfagent/bin/cf-agent', error removing link
Q: ".../cf-agent" -f /":    error: Link '/usr/local/sbin/cf-promises' points to '/var/cfengine/bin/cf-promises' not '/home/nickanderson/.cfagent/bin/cf-promises', error removing link
Q: ".../cf-agent" -f /":    error: Link '/usr/local/sbin/cf-runagent' points to '/var/cfengine/bin/cf-runagent' not '/home/nickanderson/.cfagent/bin/cf-runagent', error removing link
Q: ".../cf-agent" -f /":    error: Link '/usr/local/sbin/cf-monitord' points to '/var/cfengine/bin/cf-monitord' not '/home/nickanderson/.cfagent/bin/cf-monitord', error removing link
Q: ".../cf-agent" -f /":    error: Link '/usr/local/sbin/cf-serverd' points to '/var/cfengine/bin/cf-serverd' not '/home/nickanderson/.cfagent/bin/cf-serverd', error removing link
Q: ".../cf-agent" -f /":    error: No suitable server found
Q: ".../cf-agent" -f /":    error: No suitable server found
Q: ".../cf-agent" -f /":    error: No suitable server found
#+end_example

- This is an *agent* bundle (meaning that it is processed by =cf-agent=).
- Its purpose is to set the permissions on =/etc/shadow= and =/etc/gshadow=.
- It uses an external body named =perms_for_shadow_files=.
- The body only needs to be defined once and can be reused for any number of
  promises.

Note: The values for =owners= and =groups= is enclosed in curly braces. This is
because these attributes take a list of strings (aka, an =slist=).

** Example output

#+BEGIN_SRC shell :results output
  chmod 600 ./examples/augments/augments.cf
  cf-agent -KIf ./examples/augments/augments.cf
#+END_SRC

#+RESULTS:
: R: I defined '$(def.myvar1)' as 'defined from augments'
: R: This is a supported platform
: R: You can define classes from augments based on defined hostname

** Example output

#+BEGIN_SRC shell :results output
  chmod 600 ./examples/augments/augments-policy-wins.cf
  cf-agent -KIf ./examples/augments/augments-policy-wins.cf
#+END_SRC

#+RESULTS:
: R: I defined '$(def.myvar1)' as 'Defined in policy'
: R: I defined '$(def.myvar2)' as 'defined from augments'
: R: This is a supported platform
: R: You can define classes from augments based on defined hostname

*** Exercise: Render multiline JSON for =packagesmatching()=

=packagesmatching()= returns data. Render the multiline JSON representation of the data.

#+BEGIN_SRC cfengine3
  bundle agent main
  {
    vars:
        "p" data => packagesmatching( "emacs.*", ".*", ".*", ".*");

        "r" string => string_mustache( "{{%-top-}}", p ),
          if => not(isvariable( r ) );

    reports:
        "$(r)";

  }
#+END_SRC

#+RESULTS:
#+begin_example
R: [
  {
    "arch": "default",
    "method": "dpkg",
    "name": "emacsen-common",
    "version": "2.0.8"
  },
  {
    "arch": "default",
    "method": "dpkg",
    "name": "emacs24-common-non-dfsg",
    "version": "24.4+1-2"
  },
  {
    "arch": "default",
    "method": "dpkg",
    "name": "emacs24-common",
    "version": "24.5+1-1ubuntu2"
  },
  {
    "arch": "default",
    "method": "dpkg",
    "name": "emacs24-bin-common",
    "version": "24.5+1-1ubuntu2"
  },
  {
    "arch": "default",
    "method": "dpkg",
    "name": "emacs24",
    "version": "24.5+1-1ubuntu2"
  },
  {
    "arch": "default",
    "method": "dpkg",
    "name": "emacs",
    "version": "46.1"
  }
]
#+end_example

**** Promise logging

Promises can be configured to [[https://docs.cfengine.com/lts/reference-promise-types.html#log_repaired][log their outcomes]] to a file with =log_kept=,
=log_repaired=, and =log_failed= attributes in an action body.

#+BEGIN_SRC cfengine3
  bundle agent main
  {
    commands:
        "/bin/true"
          action => log_my_repairs( '/tmp/repaired.log' );

    reports:
        "/tmp/repaired.log"
          printfile => cat( $(this.promiser) );
  }

  body action log_my_repairs( file )
  {
        log_repaired => "$(file)";
        log_string => "$(sys.date) REPAIRED $(this.promiser)";
  }
#+END_SRC

#+RESULTS:
: R: /tmp/repaired.log
: R: Mon Dec  4 21:21:38 2017 REPAIRED /bin/true

*** Magic in CFEngine
:LOGBOOK:
CLOCK: [2017-09-28 Thu 18:39]--[2017-09-28 Thu 18:48] =>  0:09
:END:

**** If I try to define a class with an illegal class character there is no error

For example:

#+BEGIN_SRC cfengine3 :exports both 
  bundle agent main
  {
    classes:
    
      "my-illegal-class";
      
    reports:
      "$(with)" with => join( " ", classesmatching( "my.illegal.class" ) );

  }
#+END_SRC

#+RESULTS:
: R: my_illegal_class

The agent assumes you intended to canonify the string in the spirit of auto
correction it canonifies it for you.

This courtesy is not extended when checking classes. You must explicitly
canonify your string when using it in a class expression.

For example: 

#+BEGIN_SRC cfengine3 :exports both 
  bundle agent main
  {
    vars:
    
      "hostname" string => "$(sys.uqhost)";
    
    reports:
    
      any::
      
        "$(hostname) contains invalid class characters";
        "The class expression containing a nonvalid character is not a valid class expression";
        "The agent silently skips the section"; 
      
      "$(hostname)"::
        "hello";
        
      any::
      
        "See that explicit canonification works";
        "Hi"
          if => canonify( $(hostname) );
  }
  
#+END_SRC

#+RESULTS:
: R: nickanderson-thinkpad-w550s contains invalid class characters
: R: The class expression containing a nonvalid character is not a valid class expression
: R: The agent silently skips the section
: R: See that explicit canonification works
: R: Hi

**** When I promise a directory is 600 it gets set to 700

For example: 

#+BEGIN_SRC cfengine3
  bundle agent main
  {
    files:
      "/tmp/dir/."
        create => "true",
        perms => m(600);
        
   vars:
     "mode" string => filestat( "/tmp/dir", permoct );
     
     reports:
       "/tmp/dir mode is $(with)" with => filestat( "/tmp/dir", permoct );
     
  }
#+END_SRC

#+RESULTS:
: R: /tmp/dir mode is 700

This is configurable behavior but by default if you promise a directory should
be readable (list the files within the directory) the agent assumes that you
also meant for it to be executable so that it can be entered and access the file
and directories inside.
     
To disable the feature set [[https://docs.cfengine.com/lts/reference-promise-types-files.html#rxdirs][rxdirs]] to =false= in the =perms= body you are
using.

For example:

#+BEGIN_SRC cfengine3
  bundle agent main
  {
    files:
      "/tmp/dir/."
        create => "true",
        perms => my_m_norxdir(600);
        
   vars:
     "mode" string => filestat( "/tmp/dir", permoct );
     
     reports:
       "/tmp/dir mode is $(with)" with => filestat( "/tmp/dir", permoct );
  }
  
  body perms my_m_norxdir(mode)
  {
    rxdirs => "false";
    inherit_from => m( $(mode) ); # body inheritance available since 3.8.0
  }
#+END_SRC

#+RESULTS:
: R: /tmp/dir mode is 600

